<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download the latest version of Graphmatica and imports it into Munki.</string>
        <key>Identifier</key>
        <string>com.github.bobjoeb.autopkg.Graphmatica.munki</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>Mathematics</string>
            <key>NAME</key>
            <string>Graphmatica</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>Mathematics</string>
                <key>developer</key>
                <string>Graphmatica</string>
                <key>display_name</key>
                <string>Graphmatica</string>
                <key>description</key>
                <string>Graphmatica is a powerful, easy-to-use, equation plotter with numerical and calculus features. Graph Cartesian functions, relations, and inequalities, plus polar, parametric, and ordinary differential equations. Up to 999 graphs on screen at once. Offers copy to clipboard (bitmap and vector formats), graphical and numerical display of tangent lines and integrals, on-line help, and demo files.
                </string>
                <key>name</key>
                <string>%NAME%</string>
                <key>display_name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.4</string>
        <key>ParentRecipe</key>
        <string>com.github.bobjoeb.autopkg.download.Graphmatica</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>