<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download the latest version of Graphmatica and imports it into Munki.</string>
        <key>Identifier</key>
        <string>com.github.bobjoeb.autopkg.capstone.Capstone.munki</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>Mathematics</string>
            <key>NAME</key>
            <string>Capstone</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>Mathematics</string>
                <key>developer</key>
                <string>Pasco</string>
                <key>display_name</key>
                <string>Capstone</string>
                <key>description</key>
                <string>*Demo Version* Site key required for full install. PASCO Capstone was designed from the ground up to be the most powerful software available for high level physics and engineering applications or for anyone that wants the advanced capabilities it offers.
                </string>
                <key>name</key>
                <string>%NAME%</string>
                <key>display_name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.4</string>
        <key>ParentRecipe</key>
        <string>com.github.bobjoeb.autopkg.capstone.Capstone.download</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>